tsung_new_route_request.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/home/ec2-user/opt/tsung-1.5.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="www.locamotor-last-route.pyaxtkrft7.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="1" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <option name="file_server" id="file_id" value="/home/ec2-user/locationlist.csv"></option>

    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <!-- Create random elements -->
      <setdynvars sourcetype="random_number" start="1" end="2">
        <var name="rndint" />
      </setdynvars>

      <setdynvars sourcetype="random_number" start="1" end="2">
        <var name="rndint2" />
      </setdynvars>

      <setdynvars sourcetype="random_string" length="13">
        <var name="rndname" />
      </setdynvars>

      <!-- Sign in -->
      <request>
        <dyn_variable name="authenticity_token"></dyn_variable>
        <http url='/users/sign_in' version='1.1' method='GET'></http>
      </request>

      <thinktime value="3" random="true"></thinktime>

      <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
        <var name="authenticity_token" />
      </setdynvars>

      <request subst="true">
        <http url='/users/sign_in' method='POST' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;user[email]=user%%_rndint%%%40gmail.com&amp;user[password]=1234567&amp;user[remember_me]=0" content_type="application/x-www-form-urlencoded"> </http>
      </request>

      <!-- Search for path user -->
      <setdynvars sourcetype="file" fileid="file_id" delimiter=";" order="iter">
        <var name="s_street" />
        <var name="s_city" />
        <var name="s_state" />
        <var name="e_street" />
        <var name="e_city" />
        <var name="e_state" />
      </setdynvars>

      <request>
        <dyn_variable name="authenticity_token"></dyn_variable>
        <http url='/route_requests/new' version='1.1' method='GET'></http>
      </request>

      <thinktime value="3" random="true"></thinktime>

      <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
        <var name="authenticity_token" />
      </setdynvars>

      <request subst="true">
        <http url='/route_requests' method='POST' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;routes[start_time]=2016-01-01T12%3A00%3A00&amp;routes[start_street]=%%_s_street%%&amp;routes[start_city]=%%_s_city%%&amp;routes[start_state]=%%_s_state%%&amp;routes[end_street]=%%_e_street%%&amp;routes[end_city]=%%_e_city%%&amp;routes[end_state]=%%_e_state%%&amp;routes[start_max_distance]=%%_rndint%%&amp;routes[end_max_distance]=%%_rndint2%%" content_type="application/x-www-form-urlencoded"> </http>
      </request>
    </session>
  </sessions>

</tsung>